**DataFrame :**

**Features:**

1. "DataFrame" is a Data structure used in python.
2. It is just like a table, containing multiple rows and columns
3. Every row of a DataFrame holds and index automatically and the index starts from 0.
4. Mane Data Type like List, Dictionary, Series (Data Structure) and Numpy Array can be converted into a DataFrame using Pandas.
5. DataFrames are indexable both by column and row. Also one can subset a DataFrame based on conditions.

**Lets start working with DataFrame...**

In [1]:
import pandas as pd #importing liabrary
alpha = [8,7,6] #list
xy = pd.DataFrame(alpha) #creating DataFrame

In [2]:
xy

   0
0  8
1  7
2  6

**By default every element has an index 0,1,2 and so on....**

In [3]:
alpha = [['Ibrahim',28], ['Zeeshan', 29], ['Krishna', 30]] #n-dimensional array
qa = pd.DataFrame(alpha,columns=['Name','Age']) #converting to dataframe

In [4]:
qa #with column name

      Name  Age
0  Ibrahim   28
1  Zeeshan   29
2  Krishna   30

In [5]:
import numpy as np
zx = np.array([[4,5,6],[7,8,9],[10,11,12]]) #numpy multidimensional array
py =pd.DataFrame(zx) #converting an array to a dataframe

In [6]:
py

    0   1   2
0   4   5   6
1   7   8   9
2  10  11  12

In [7]:
dictionary_1={'Ibrahim':[4,5,6],'Zeeshan':[3,2,1],'Krishna':[7,8,9]} #creating dictionary
df =pd.DataFrame(dictionary_1) #converting the dictionary into DataFrame

In [8]:
df

   Ibrahim  Zeeshan  Krishna
0        4        3        7
1        5        2        8
2        6        1        9

**Setting index Manually**

In [9]:
df =pd.DataFrame(dictionary_1,index=['1st qtr','2nd qtr','3rd qtr']) #Settinng index Manually

In [10]:
df

         Ibrahim  Zeeshan  Krishna
1st qtr        4        3        7
2nd qtr        5        2        8
3rd qtr        6        1        9

**Setting index and column names simultaneously:**

In [11]:
AD = pd.DataFrame(zx, index=['1st qtr','2nd qtr','3rd qtr'], columns=['Ibrahim','Zeeshan','Krishna']) #setting index and column manually

In [12]:
AD

         Ibrahim  Zeeshan  Krishna
1st qtr        4        5        6
2nd qtr        7        8        9
3rd qtr       10       11       12

In [13]:
AD2= AD[['Ibrahim','Krishna']].copy() #creating new DataFrame from old one

In [14]:
AD2

         Ibrahim  Krishna
1st qtr        4        6
2nd qtr        7        9
3rd qtr       10       12

In [15]:
AD['Zeeshan'] # indexing by column/ taking only a column from the DataFrame

1st qtr     5
2nd qtr     8
3rd qtr    11
Name: Zeeshan, dtype: int32

In [16]:
AD[['Zeeshan','Krishna']] #taking multiple columns from the dataframe

         Zeeshan  Krishna
1st qtr        5        6
2nd qtr        8        9
3rd qtr       11       12

In [17]:
x= pd.DataFrame([9,6,3], columns=['Shahbaz']) #creating a new dataframe with a column I want to add
AD['Shahbaz'] = x['Shahbaz'] #adding the new column to the existing dataframe

In [18]:
AD

         Ibrahim  Zeeshan  Krishna  Shahbaz
1st qtr        4        5        6      NaN
2nd qtr        7        8        9      NaN
3rd qtr       10       11       12      NaN

In [19]:
x= pd.DataFrame([9,6,3], index=['1st qtr','2nd qtr','3rd qtr'], columns=['Shahbaz'])

In [20]:
x

         Shahbaz
1st qtr        9
2nd qtr        6
3rd qtr        3

In [21]:
AD['Shahbaz'] = x ['Shahbaz']

In [22]:
AD

         Ibrahim  Zeeshan  Krishna  Shahbaz
1st qtr        4        5        6        9
2nd qtr        7        8        9        6
3rd qtr       10       11       12        3

# Thank You